import {GeoCoords} from "@/ts_server";

export function get_random_person() {
    // Randomly determine if the person is male or female
    const is_man = Math.random() < 0.5;

    // Randomly select a name and surname based on gender
    const name = is_man
        ? man_names[Math.floor(Math.random() * man_names.length)]
        : woman_names[Math.floor(Math.random() * woman_names.length)];

    const surname = is_man
        ? man_surname[Math.floor(Math.random() * man_surname.length)]
        : woman_surname[Math.floor(Math.random() * woman_surname.length)];


    // Randomly generate a birthdate between 1970 and 2000
    const birthdate = new Date(1970 + Math.floor(Math.random() * 30), Math.floor(Math.random() * 12), Math.floor(Math.random() * 28)).getTime();
    // Return the person object

    // IIN is 12 digits, first 6 digits are birthdate in YYMMDD format
    const iin = new Date(birthdate).toISOString().slice(2, 10).replace(/-/g, "") + Math.floor(Math.random() * 1000).toString().padStart(3, "0");


    const geocoords:GeoCoords = {
      // Random lan within almaty
      lat: 43.238949 + Math.random() * 0.1,
      lng: 76.889709 + Math.random() * 0.1
    };

    return { is_man, name, surname, birthdate,iin,geocoords };
}

const man_names = [
  "Жанибек", "Айдос", "Алишер", "Айбек", "Айдар", "Айболат", "Айжол", "Айкен",
  "Бахытжан", "Берик", "Ержан", "Нуржан", "Саян", "Саят", "Самат", "Сарсен",
  "Ермек", "Ерлан", "Даурен", "Мухамед", "Мурат", "Кайрат", "Жангельды", "Талгат",
  "Елжан", "Бекжан", "Азамат", "Анвар", "Нурбол", "Нурсултан", "Нуртас", "Мади",
  "Асан", "Улан", "Жанат", "Жанболат", "Жарылкап", "Еркебулан", "Есет", "Ерасыл",
  "Жасулан", "Жанарбек", "Акан", "Болат", "Батыр", "Ануар", "Али", "Алмас",
  "Нурислам", "Тимирхан", "Серик", "Султан", "Серикжан", "Тимур", "Тохтар", "Сакен",
  "Бахыт", "Бексултан", "Даулет", "Ислам", "Ильяс", "Имран", "Дидар", "Ерсултан",
  "Канат", "Куат", "Куаныш", "Рамазан", "Руслан", "Талгат", "Шерхан", "Шынгыс",
  "Айтуар", "Азамат", "Алихан", "Амир", "Арман", "Артур", "Асанали", "Асхат",
  "Берикбол", "Беркин", "Ерсайын", "Жандос", "Жаркен", "Жолдасбек", "Жумекен", "Карим",
  "Марат", "Мерей", "Нурик", "Орман", "Рамиль", "Рустам", "Сабыр", "Сабит",
  "Санжар", "Сапар", "Талант", "Тлектес"
];

const man_surname = [
  "Жумабаев", "Абдуллин", "Жакупов", "Турабаев", "Касымов", "Нургалиев", "Оспанов", "Сарсенбаев",
  "Кожахметов", "Жумагулов", "Исатаев", "Нурбеков", "Жаныбеков", "Ахметов", "Жайлаубаев", "Бекболатов",
  "Кубенов", "Мусаев", "Рахметов", "Утебеков", "Сагатбаев", "Турганбаев", "Насыров", "Бекмухамбетов",
  "Токтасынов", "Темирбаев", "Орынбаев", "Муханов", "Куанышев", "Сембаев", "Байжанов", "Елемесов",
  "Айтжанов", "Утегенов", "Айтбаев", "Есенгельдиев", "Ниязов", "Каримов", "Дауренов", "Суйндиков",
  "Баймуратов", "Шарипов", "Назаров", "Иманов", "Тасмаганбетов", "Омаров", "Джумадилов", "Мирманов",
  "Елеусизов", "Байгазин", "Исмагулов", "Баймуханов", "Джанабеков", "Аймаганбетов", "Мамыров", "Кенжебаев",
  "Еркинбаев", "Нуртазин", "Жалгасбаев", "Муканов", "Ерболатов", "Сатыбалдиев", "Алибаев", "Бескемпиров",
  "Мадиев", "Алдияров", "Айдаров", "Жусупов", "Тастемиров", "Турсынбаев", "Каскенов", "Мухамеджанов",
  "Тлепов", "Темирбеков", "Оралбеков", "Басенов", "Абилов", "Ботабеков", "Сулейменов", "Кайырбеков",
  "Турсунов", "Табанов", "Ашимов", "Базарбаев", "Койшыбаев", "Жанибеков", "Райымбеков", "Абдыкалыков",
  "Сулейменов", "Садуов", "Курманов", "Шарипов", "Темирбаев", "Сагинтаев", "Тургумбаев", "Калдыбаев"
];


const woman_names = [
  "Айжан", "Аяжан", "Айнур", "Аружан", "Асель", "Гульнур", "Гулмира", "Айсулу",
  "Айгуль", "Балжан", "Бакытжан", "Дильназ", "Динара", "Еркежан", "Жанель", "Жанар",
  "Жанна", "Жаныл", "Жанат", "Зауреш", "Замира", "Зарина", "Индира", "Камшат",
  "Куралай", "Мадина", "Майра", "Маржан", "Мерей", "Назгуль", "Назира", "Нургуль",
  "Сабина", "Сания", "Сара", "Сауле", "Салтанат", "Сандугаш", "Сания", "Сабира",
  "Толкын", "Фариза", "Хадиша", "Шолпан", "Альмира", "Айым", "Айсара", "Акмарал",
  "Айша", "Алима", "Алия", "Алтын", "Алма", "Айкен", "Айлин", "Алибек",
  "Бахыт", "Береке", "Гаухар", "Гульмира", "Гульназ", "Гульжан", "Гулжанат", "Дана",
  "Дария", "Диана", "Дильнура", "Жансая", "Жибек", "Жулдыз", "Зейнеп", "Зульфия",
  "Камиля", "Карима", "Клара", "Лаура", "Ляззат", "Малика", "Меруерт", "Мукарама",
  "Надия", "Нурия", "Рахиля", "Рауан", "Роза", "Сабина", "Сагида", "Саида",
  "Сабира", "Сания", "Саним", "Сара", "Сауле", "Саним", "Таншолпан", "Тамара",
  "Толкын", "Тоты", "Шарипа", "Шахназ", "Шырайлым", "Шынар", "Эльмира", "Ясмина"
];


const woman_surname = [
  "Жумабаева", "Абдуллина", "Жакупова", "Турабаева", "Касымова", "Нургалиева", "Оспанова", "Сарсенбаева",
  "Кожахметова", "Жумагулова", "Исатаева", "Нурбекова", "Жаныбекова", "Ахметова", "Жайлаубаева", "Бекболатова",
  "Кубенова", "Мусаева", "Рахметова", "Утебекова", "Сагатбаева", "Турганбаева", "Насырова", "Бекмухамбетова",
  "Токтасынова", "Темирбаева", "Орынбаева", "Муханова", "Куанышева", "Сембаева", "Байжанова", "Елемесова",
  "Айтжанова", "Утегенова", "Айтбаева", "Есенгельдиева", "Ниязова", "Каримова", "Дауренова", "Суйндикова",
  "Баймуратова", "Шарипова", "Назарова", "Иманова", "Тасмаганбетова", "Омарова", "Джумадилова", "Мирманова",
  "Елеусизова", "Байгазина", "Исмагулова", "Баймуханова", "Джанабекова", "Аймаганбетова", "Мамырова", "Кенжебаева",
  "Еркинбаева", "Нуртазина", "Жалгасбаева", "Муканова", "Ерболатова", "Сатыбалдиева", "Алибаева", "Бескемпирова",
  "Мадиева", "Алдиярова", "Айдарова", "Жусупова", "Тастемирова", "Турсынбаева", "Каскенова", "Мухамеджанова",
  "Тлепова", "Темирбекова", "Оралбекова", "Басенова", "Абилова", "Ботабекова", "Сулейменова", "Кайырбекова",
  "Турсунова", "Табанова", "Ашимова", "Базарбаева", "Койшыбаева", "Жанибекова", "Райымбекова", "Абдыкалыкова",
  "Сулейменова", "Садуова", "Курманова", "Шарипова", "Темирбаева", "Сагинтаева", "Тургумбаева", "Калдыбаева"
];



